// --- LISTA DE EMOJIS POR CATEGORIA ---
export const EMOJI_DATA = [
    {
        id: 'reaction',
        icon: '😮',
        label: 'Reações',
        emojis: [
            "👀", "👻", "👽", "🎃",
            "😷", "🥶", "🥵", "🤪", "🤫", "🤭", "🧐", "🤓", "🤔", "🤨",
            "😐", "😑", "😶", "🙄", "😏", "😴", "😪", "🤤", "😱"
        ]
    },
    {
        id: 'hands',
        icon: '👍',
        label: 'Mãos',
        emojis: [
            "👍", "👊", "✌️", "🤘", "👌", "👈", "👉", "👆", "👇",
            "💪", "🙏", "👏", "🙌", "👐", "🤝", "💅", "👋",
            "🖐️", "🤏", "🤙", "🤚", "🤛", "🤜", "🫶",
        ]
    },
    {
        id: 'foods',
        icon: '🍆',
        label: 'Clássicos',
        emojis: [
            "🍆", "🍑", "🍺", "🍸", "🥂", "🍾", "🍹", "🌽", "🍰", "🎂",
            "🥕", "🍌", "🍕", "🍇", "🍏", "🍒", "🍍", "🍫", "🍼", "🍭"
        ]
    },
    {
        id: 'party',
        icon: '🎉',
        label: 'Clássicos',
        emojis: [
            "🔥", "❤️", "😍", "🍺", "🍸", "🥂", "🍾", 
            "💋", "🕺", "🎉", "✨", "😈", "😇", "👑", "💎",
            "😎", "🤩", "🤑", "🤠", "🥳", "🥴", "🤯", "🤬"
        ]
    },
    {
        id: 'music',
        icon: '🎵',
        label: 'Música',
        emojis: [
            "🎵", "🎧", "🎤", "🎸", "🎷", "🥁", "🎹", "🎺", "🎼", "🔊",
            "🔈", "🔇", "📻", "🎙️", "🎚️", "🎛️", "🎶", "💿", "📀", "📼"
        ]
    },
    {
        id: 'flags',
        icon: '🏳️',
        label: 'Bandeiras',
        emojis: [
            "🏳️‍🌈", "🏳️‍⚧️", "🇧🇷", "🇺🇸", "🇪🇸", "🇫🇷", "🇮🇹", "🇩🇪", "🇯🇵", "🇰🇷",
            "🇨🇳", "🇷🇺", "🇬🇧", "🇨🇦", "🇦🇷", "🇨🇱", "🇨🇴", "🇲🇽", "🇵🇹", "🏴‍☠️"
        ]
    },
    {
        id: 'signs',
        icon: '🔄',
        label: 'Placas & Setas',
        emojis: [
            "🛑", "🚧", "🚦", "🚥", "🚨", "🚫", "✅", "❌", "⚠️",
            "⬆️", "⬇️", "⬅️", "➡️", "↕️", "↔️",
            "🔄", "▶️", "⏸️", "🚾", "🔞", "🆘", "💯", "💢", "💥"
        ]
    }
];

// --- PALETA DE 10 CORES (SIMPLES) ---
// Cores vibrantes para o placar dark mode
export const COLOR_PALETTE = [
    "#ff4d00", // 1. Laranja
    "#ffcc00", // 2. Amarelo
    "#ff0033", // 3. Vermelho
    "#00eeff", // 4. Azul Cyan
    "#aa00ff", // 5. Roxo
    "#ccff00", // 6. Verde Lima
    "#ff0099", // 7. Rosa
    "#2962ff", // 8. Azul Royal
    "#00c853", // 9. Verde
    "#ffffff"  // 10. Branco
];